#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cms_function_app.azurerm_monitor_autoscale_setting.cms_fn will be created
  + resource "azurerm_monitor_autoscale_setting" "cms_fn" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-svc-cms-func-as-01"
      + resource_group_name = "io-p-itn-svc-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"

      + profile {
          + name = "default"

          + capacity {
              + default = 3
              + maximum = 30
              + minimum = 3
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 3000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_namespace   = "microsoft.web/serverfarms"
                  + metric_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 80
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_namespace   = "microsoft.web/serverfarms"
                  + metric_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 30
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.cms_function_app.azurerm_monitor_metric_alert.cms_fn_health_check will be created
  + resource "azurerm_monitor_metric_alert" "cms_fn_health_check" {
      + auto_mitigate            = true
      + description              = "io-p-itn-svc-cms-func-01 health check failed"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-func-01-health-check-failed"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.cms_function_app.azurerm_monitor_metric_alert.cms_fn_st_low_availability will be created
  + resource "azurerm_monitor_metric_alert" "cms_fn_st_low_availability" {
      + auto_mitigate            = true
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnsvccmsstfn01] Low Availability"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01",
        ]
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = "ab45103a-cb4f-474b-933f-d802ed1082d5"
          + "APPLICATION_INSIGHTS_NO_PATCH_MODULES"                 = "pg"
          + "ASSET_STORAGE_CONNECTIONSTRING"                        = (sensitive value)
          + "AZURE_APIM"                                            = "io-p-apim-v2-api"
          + "AZURE_APIM_RESOURCE_GROUP"                             = "io-p-rg-internal"
          + "AZURE_APIM_SUBSCRIPTION_PRODUCT_NAME"                  = "io-services-api"
          + "AZURE_CLIENT_SECRET_CREDENTIAL_CLIENT_ID"              = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_SECRET"                 = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_TENANT_ID"              = "7788edaf-0346-4068-9d79-c868aed15b3d"
          + "AZURE_SUBSCRIPTION_ID"                                 = "ec285037-c673-4f58-b594-d7c480da4e8b"
          + "AzureWebJobs.LegacyServiceWatcher.Disabled"            = "1"
          + "AzureWebJobs.OnRequestDeletion.Disabled"               = "1"
          + "AzureWebJobs.OnRequestDetail.Disabled"                 = "1"
          + "AzureWebJobs.OnRequestHistoricization.Disabled"        = "1"
          + "AzureWebJobs.OnRequestPublication.Disabled"            = "1"
          + "AzureWebJobs.OnRequestReview.Disabled"                 = "1"
          + "AzureWebJobs.OnRequestReviewLegacy.Disabled"           = "1"
          + "AzureWebJobs.OnRequestSyncCms.Disabled"                = "1"
          + "AzureWebJobs.OnRequestSyncLegacy.Disabled"             = "1"
          + "AzureWebJobs.OnRequestValidation.Disabled"             = "1"
          + "AzureWebJobs.ServiceDetailLifecycleWatcher.Disabled"   = "1"
          + "AzureWebJobs.ServiceDetailPublicationWatcher.Disabled" = "1"
          + "AzureWebJobs.ServiceHistoryWatcher.Disabled"           = "1"
          + "AzureWebJobs.ServiceLifecycleWatcher.Disabled"         = "1"
          + "AzureWebJobs.ServicePublicationWatcher.Disabled"       = "1"
          + "AzureWebJobs.ServiceReviewChecker.Disabled"            = "1"
          + "AzureWebJobs.ServiceReviewLegacyChecker.Disabled"      = "1"
          + "BACKOFFICE_INTERNAL_SUBNET_CIDRS"                      = "10.0.135.128/26"
          + "COSMOSDB_APP_BE_NAME"                                  = "app-be"
          + "COSMOSDB_CONNECTIONSTRING"                             = (sensitive value)
          + "COSMOSDB_CONTAINER_SERVICES_DETAILS"                   = "services"
          + "COSMOSDB_CONTAINER_SERVICES_HISTORY"                   = "services-history"
          + "COSMOSDB_CONTAINER_SERVICES_LIFECYCLE"                 = "services-lifecycle"
          + "COSMOSDB_CONTAINER_SERVICES_PUBLICATION"               = "services-publication"
          + "COSMOSDB_KEY"                                          = (sensitive value)
          + "COSMOSDB_NAME"                                         = "db-services-cms"
          + "COSMOSDB_URI"                                          = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                               = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                   = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                      = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                           = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                     = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                               = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                        = "4"
          + "INTERNAL_STORAGE_CONNECTION_STRING"                    = (sensitive value)
          + "JIRA_CONTRACT_CUSTOM_FIELD"                            = "customfield_10365"
          + "JIRA_DELEGATE_EMAIL_CUSTOM_FIELD"                      = "customfield_10383"
          + "JIRA_DELEGATE_NAME_CUSTOM_FIELD"                       = "customfield_10382"
          + "JIRA_NAMESPACE_URL"                                    = "https://pagopa.atlassian.net"
          + "JIRA_ORGANIZATION_CF_CUSTOM_FIELD"                     = "customfield_10364"
          + "JIRA_ORGANIZATION_NAME_CUSTOM_FIELD"                   = "customfield_10381"
          + "JIRA_PROJECT_NAME"                                     = "IEST"
          + "JIRA_TOKEN"                                            = (sensitive value)
          + "JIRA_TRANSITION_UPDATED_ID"                            = "4"
          + "JIRA_USERNAME"                                         = "io-pagopa-github-bot@pagopa.it"
          + "LEGACY_COSMOSDB_CONNECTIONSTRING"                      = (sensitive value)
          + "LEGACY_COSMOSDB_CONTAINER_SERVICES"                    = "services"
          + "LEGACY_COSMOSDB_CONTAINER_SERVICES_LEASE"              = "services-cms--legacy-watcher-lease"
          + "LEGACY_COSMOSDB_KEY"                                   = (sensitive value)
          + "LEGACY_COSMOSDB_NAME"                                  = "db"
          + "LEGACY_COSMOSDB_URI"                                   = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "LEGACY_JIRA_PROJECT_NAME"                              = "IES"
          + "LEGACY_SERVICE_WATCHER_MAX_ITEMS_PER_INVOCATION"       = "10"
          + "MANUAL_REVIEW_PROPERTIES"                              = "data.name,data.description,data.organization.name,data.organization.fiscal_code"
          + "NODE_ENV"                                              = "production"
          + "REQUEST_DELETION_QUEUE"                                = "request-deletion"
          + "REQUEST_DETAIL_QUEUE"                                  = "request-detail"
          + "REQUEST_HISTORICIZATION_QUEUE"                         = "request-historicization"
          + "REQUEST_PUBLICATION_QUEUE"                             = "request-publication"
          + "REQUEST_REVIEW_LEGACY_QUEUE"                           = "request-review-legacy"
          + "REQUEST_REVIEW_QUEUE"                                  = "request-review"
          + "REQUEST_SYNC_CMS_QUEUE"                                = "request-sync-cms"
          + "REQUEST_SYNC_LEGACY_QUEUE"                             = "request-sync-legacy"
          + "REQUEST_VALIDATION_QUEUE"                              = "request-validation"
          + "REVIEWER_DB_HOST"                                      = "io-p-services-cms-private-pgflex.postgres.database.azure.com"
          + "REVIEWER_DB_NAME"                                      = "reviewer"
          + "REVIEWER_DB_PASSWORD"                                  = (sensitive value)
          + "REVIEWER_DB_PORT"                                      = "6432"
          + "REVIEWER_DB_SCHEMA"                                    = "reviewer"
          + "REVIEWER_DB_TABLE"                                     = "service_review"
          + "REVIEWER_DB_USER"                                      = "reviewerusr"
          + "SERVICEID_QUALITY_CHECK_EXCLUSION_LIST"                = (sensitive value)
          + "SLOT_TASK_HUBNAME"                                     = "ProductionTaskHub"
          + "TOPIC_DB_SCHEMA"                                       = "taxonomy"
          + "TOPIC_DB_TABLE"                                        = "topic"
          + "USERID_AUTOMATIC_SERVICE_APPROVAL_INCLUSION_LIST"      = ""
          + "USERID_CMS_TO_LEGACY_SYNC_INCLUSION_LIST"              = "*"
          + "USERID_LEGACY_TO_CMS_SYNC_INCLUSION_LIST"              = "*"
          + "USERID_REQUEST_REVIEW_LEGACY_INCLUSION_LIST"           = "*"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"       = "1"
          + "WEBSITE_DNS_SERVER"                                    = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-svc-cms-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-svc-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-cms-asp-01"
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnsvccmsstfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "18"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureWebJobs.LegacyServiceWatcher.Disabled",
              + "AzureWebJobs.ServiceLifecycleWatcher.Disabled",
              + "AzureWebJobs.ServicePublicationWatcher.Disabled",
              + "AzureWebJobs.ServiceReviewChecker.Disabled",
              + "AzureWebJobs.ServiceHistoryWatcher.Disabled",
              + "AzureWebJobs.OnRequestHistoricization.Disabled",
              + "AzureWebJobs.OnRequestPublication.Disabled",
              + "AzureWebJobs.OnRequestReview.Disabled",
              + "AzureWebJobs.OnRequestSyncCms.Disabled",
              + "AzureWebJobs.OnRequestSyncLegacy.Disabled",
              + "AzureWebJobs.OnRequestReviewLegacy.Disabled",
              + "AzureWebJobs.ServiceReviewLegacyChecker.Disabled",
              + "AzureWebJobs.OnRequestValidation.Disabled",
              + "AzureWebJobs.OnRequestDeletion.Disabled",
              + "AzureWebJobs.OnRequestDetail.Disabled",
              + "AzureWebJobs.ServiceDetailLifecycleWatcher.Disabled",
              + "AzureWebJobs.ServiceDetailPublicationWatcher.Disabled",
            ]
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app_slot.this[0] will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = "ab45103a-cb4f-474b-933f-d802ed1082d5"
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                       = "5"
          + "APPLICATION_INSIGHTS_NO_PATCH_MODULES"                 = "pg"
          + "ASSET_STORAGE_CONNECTIONSTRING"                        = (sensitive value)
          + "AZURE_APIM"                                            = "io-p-apim-v2-api"
          + "AZURE_APIM_RESOURCE_GROUP"                             = "io-p-rg-internal"
          + "AZURE_APIM_SUBSCRIPTION_PRODUCT_NAME"                  = "io-services-api"
          + "AZURE_CLIENT_SECRET_CREDENTIAL_CLIENT_ID"              = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_SECRET"                 = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_TENANT_ID"              = "7788edaf-0346-4068-9d79-c868aed15b3d"
          + "AZURE_SUBSCRIPTION_ID"                                 = "ec285037-c673-4f58-b594-d7c480da4e8b"
          + "AzureWebJobs.LegacyServiceWatcher.Disabled"            = "1"
          + "AzureWebJobs.OnRequestDeletion.Disabled"               = "1"
          + "AzureWebJobs.OnRequestDetail.Disabled"                 = "1"
          + "AzureWebJobs.OnRequestHistoricization.Disabled"        = "1"
          + "AzureWebJobs.OnRequestPublication.Disabled"            = "1"
          + "AzureWebJobs.OnRequestReview.Disabled"                 = "1"
          + "AzureWebJobs.OnRequestReviewLegacy.Disabled"           = "1"
          + "AzureWebJobs.OnRequestSyncCms.Disabled"                = "1"
          + "AzureWebJobs.OnRequestSyncLegacy.Disabled"             = "1"
          + "AzureWebJobs.OnRequestValidation.Disabled"             = "1"
          + "AzureWebJobs.ServiceDetailLifecycleWatcher.Disabled"   = "1"
          + "AzureWebJobs.ServiceDetailPublicationWatcher.Disabled" = "1"
          + "AzureWebJobs.ServiceHistoryWatcher.Disabled"           = "1"
          + "AzureWebJobs.ServiceLifecycleWatcher.Disabled"         = "1"
          + "AzureWebJobs.ServicePublicationWatcher.Disabled"       = "1"
          + "AzureWebJobs.ServiceReviewChecker.Disabled"            = "1"
          + "AzureWebJobs.ServiceReviewLegacyChecker.Disabled"      = "1"
          + "BACKOFFICE_INTERNAL_SUBNET_CIDRS"                      = "10.0.135.128/26"
          + "COSMOSDB_APP_BE_NAME"                                  = "app-be"
          + "COSMOSDB_CONNECTIONSTRING"                             = (sensitive value)
          + "COSMOSDB_CONTAINER_SERVICES_DETAILS"                   = "services"
          + "COSMOSDB_CONTAINER_SERVICES_HISTORY"                   = "services-history"
          + "COSMOSDB_CONTAINER_SERVICES_LIFECYCLE"                 = "services-lifecycle"
          + "COSMOSDB_CONTAINER_SERVICES_PUBLICATION"               = "services-publication"
          + "COSMOSDB_KEY"                                          = (sensitive value)
          + "COSMOSDB_NAME"                                         = "db-services-cms"
          + "COSMOSDB_URI"                                          = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                               = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                   = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                      = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                           = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                     = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                               = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                        = "4"
          + "INTERNAL_STORAGE_CONNECTION_STRING"                    = (sensitive value)
          + "JIRA_CONTRACT_CUSTOM_FIELD"                            = "customfield_10365"
          + "JIRA_DELEGATE_EMAIL_CUSTOM_FIELD"                      = "customfield_10383"
          + "JIRA_DELEGATE_NAME_CUSTOM_FIELD"                       = "customfield_10382"
          + "JIRA_NAMESPACE_URL"                                    = "https://pagopa.atlassian.net"
          + "JIRA_ORGANIZATION_CF_CUSTOM_FIELD"                     = "customfield_10364"
          + "JIRA_ORGANIZATION_NAME_CUSTOM_FIELD"                   = "customfield_10381"
          + "JIRA_PROJECT_NAME"                                     = "IEST"
          + "JIRA_TOKEN"                                            = (sensitive value)
          + "JIRA_TRANSITION_UPDATED_ID"                            = "4"
          + "JIRA_USERNAME"                                         = "io-pagopa-github-bot@pagopa.it"
          + "LEGACY_COSMOSDB_CONNECTIONSTRING"                      = (sensitive value)
          + "LEGACY_COSMOSDB_CONTAINER_SERVICES"                    = "services"
          + "LEGACY_COSMOSDB_CONTAINER_SERVICES_LEASE"              = "services-cms--legacy-watcher-lease"
          + "LEGACY_COSMOSDB_KEY"                                   = (sensitive value)
          + "LEGACY_COSMOSDB_NAME"                                  = "db"
          + "LEGACY_COSMOSDB_URI"                                   = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "LEGACY_JIRA_PROJECT_NAME"                              = "IES"
          + "LEGACY_SERVICE_WATCHER_MAX_ITEMS_PER_INVOCATION"       = "10"
          + "MANUAL_REVIEW_PROPERTIES"                              = "data.name,data.description,data.organization.name,data.organization.fiscal_code"
          + "NODE_ENV"                                              = "production"
          + "REQUEST_DELETION_QUEUE"                                = "request-deletion"
          + "REQUEST_DETAIL_QUEUE"                                  = "request-detail"
          + "REQUEST_HISTORICIZATION_QUEUE"                         = "request-historicization"
          + "REQUEST_PUBLICATION_QUEUE"                             = "request-publication"
          + "REQUEST_REVIEW_LEGACY_QUEUE"                           = "request-review-legacy"
          + "REQUEST_REVIEW_QUEUE"                                  = "request-review"
          + "REQUEST_SYNC_CMS_QUEUE"                                = "request-sync-cms"
          + "REQUEST_SYNC_LEGACY_QUEUE"                             = "request-sync-legacy"
          + "REQUEST_VALIDATION_QUEUE"                              = "request-validation"
          + "REVIEWER_DB_HOST"                                      = "io-p-services-cms-private-pgflex.postgres.database.azure.com"
          + "REVIEWER_DB_NAME"                                      = "reviewer"
          + "REVIEWER_DB_PASSWORD"                                  = (sensitive value)
          + "REVIEWER_DB_PORT"                                      = "6432"
          + "REVIEWER_DB_SCHEMA"                                    = "reviewer"
          + "REVIEWER_DB_TABLE"                                     = "service_review"
          + "REVIEWER_DB_USER"                                      = "reviewerusr"
          + "SERVICEID_QUALITY_CHECK_EXCLUSION_LIST"                = (sensitive value)
          + "SLOT_TASK_HUBNAME"                                     = "StagingTaskHub"
          + "TOPIC_DB_SCHEMA"                                       = "taxonomy"
          + "TOPIC_DB_TABLE"                                        = "topic"
          + "USERID_AUTOMATIC_SERVICE_APPROVAL_INCLUSION_LIST"      = ""
          + "USERID_CMS_TO_LEGACY_SYNC_INCLUSION_LIST"              = "*"
          + "USERID_LEGACY_TO_CMS_SYNC_INCLUSION_LIST"              = "*"
          + "USERID_REQUEST_REVIEW_LEGACY_INCLUSION_LIST"           = "*"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"       = "1"
          + "WEBSITE_DNS_SERVER"                                    = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnsvccmsstfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "18"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cms-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cms-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_private_endpoint.staging_function_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cms-staging-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cms-staging-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.staging_function_storage_account_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass                     = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsstfn01"
      + virtual_network_subnet_ids = (known after apply)
    }

  # module.cms_function_app.module.cms_fn.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.9.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-svc-cms-func-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
